Reports/КСУ_НезакрытыеЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>КСУ_НезакрытыеЗаказы</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаказыНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаказыНаПриобретение</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИА_ИсторияСтатусовЗВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИсторияСтатусовЗВС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_СостояниеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СостояниеЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотретьНаФП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносНаСледующееФП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Comment>VAT Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНастройкаИнтеркампани</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеркампани</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнаяЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЛоготип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяПлательщикомНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/КСУ_НезакрытыеЗаказы/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ДоходыПодр = Константы.КСУ_ДоходыПоПодразделениям.Получить();
	ПодрДетализация = ИспПодр и не ДоходыПодр; 
	
	ТабДок.Очистить();
	
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.ПолучитьМакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	ТекДата = ТекущаяДата();
	обл.параметры.ДатаОтчета = ТекДата;
	обл.параметры.Период = формат(НаДату,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	ЕстьФильтры = ложь;
	ВыбФонды = Новый массив;
	Для каждого стр из Фонды Цикл
		Если стр.выбрать Тогда
			ВыбФонды.Добавить(стр.фонд);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбПодр = Новый массив;
	Для каждого стр из Подразделения Цикл
		Если стр.выбрать Тогда
			ВыбПодр.Добавить(стр.Подразделение);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбОрг = Новый массив;
	Для каждого стр из Организации Цикл
		Если стр.выбрать Тогда
			ВыбОрг.Добавить(стр.Организация);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбОргД = Новый массив;
	Для каждого стр из ОрганизацииДочерние Цикл
		Если стр.выбрать Тогда
			ВыбОргД.Добавить(стр.Организация);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЧтоТоВыбрано = ложь;
	Для сч =1 по Настройки.Количество() - 1 Цикл
		если Настройки[сч].Выбрать Тогда
			ЧтоТоВыбрано = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	////////////////////////////////////////////////////////
	
	Если ЕстьФильтры Тогда
		Обл = макет.ПолучитьОбласть("Фильтры");		
		ТабДок.Вывести(обл);
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("ПредДень", НачалоДня(НаДату-1));
	Запрос.УстановитьПараметр("Фонды", ВыбФонды);
	Запрос.УстановитьПараметр("Подразделения", ВыбПодр);
	Запрос.УстановитьПараметр("Организации", ВыбОрг);
	Запрос.УстановитьПараметр("ОрганизацииД", ВыбОргД);
	Запрос.УстановитьПараметр("РассмНаФП", Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП);
	Запрос.УстановитьПараметр("ПереносНаСлФП", Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП);
	
	// подготовка данных
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыОстатки.Организация КАК Организация,
	               |	ЗаказыОстатки.ЗП КАК Заказ,
	               |	ЗаказыОстатки.ЗП.Подразделение КАК Подразделение,
	               |	ЗаказыОстатки.ЗП.Подразделение.Наименование КАК ПодразделениеНаименование,
	               |	ЗаказыОстатки.ЗП.Фонд КАК Фонд,
	               |	ЗаказыОстатки.ЗП.Фонд.Наименование КАК ФондНаименование,
	               |	ЗаказыОстатки.ЗП.Фонд.Счет КАК Счет,
	               |	ЗаказыОстатки.ЗП.Фонд.Счет.Наименование КАК СчетНаименование,
	               |	ЗаказыОстатки.ЗП.Сумма КАК СуммаЗаказа,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход, 0) КАК Одобрено,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход, 0) КАК Выплачено,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход, 0) - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход, 0) КАК ОсталосьВыплатитьОдобр,
	               |	ВЫБОР
	               |		КОГДА ЗаказыОстатки.ЗП.Сумма - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход, 0) > 0
	               |			ТОГДА ЗаказыОстатки.ЗП.Сумма - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОсталосьОдобрить,
				   |	ВЫБОР
	               |		КОГДА ЗаказыОстатки.ЗП.Сумма - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход, 0) > 0
	               |			ТОГДА ЗаказыОстатки.ЗП.Сумма - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОсталосьВыплатить,
	               |	ЗаказыОстатки.ЗП.Статья КАК Статья,
	               |	ЗаказыОстатки.ЗП.Статья.Наименование КАК СтатьяНаименование,
	               |	ЗаказыОстатки.ЗП.Номер КАК Номер,
	               |	ЗаказыОстатки.ЗП.ПредметЗаказа КАК Предмет,
	               |	ЗаказыОстатки.ЗП.ДатаОплаты КАК СрокОплаты,
	               |	ВЫБОР
	               |		КОГДА ЗаказыОстатки.ЗП.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ЗаказыОстатки.ЗП.ДатаОплаты <= &ПредДень
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоПросрочка,
	               |	РАЗНОСТЬДАТ(ЗаказыОстатки.ЗП.ДатаОплаты, &ПредДень, ДЕНЬ) + 1 КАК Просрочено,
	               |	ИА_ИсторияСтатусовЗВССрезПоследних.Период КАК ДатаДопущен
	               |ИЗ
	               |	РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(
	               |			&НаДату,
	               |			Организация В (&Организации)
	               |				И ЗП.ОрганизацияДочерняя В (&ОрганизацииД)
	               |				И ЗП.Фонд В (&Фонды)
	               |				И ЗП.Подразделение В (&Подразделения)) КАК ЗаказыОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &НаДату, , ) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |		ПО ЗаказыОстатки.ЗП = ИА_СредстваВРезервеНаФондахОбороты.ЗП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИсторияСтатусовЗВС.СрезПоследних(
	               |				,
	               |				Статус = &РассмНаФП
	               |					ИЛИ Статус = &ПереносНаСлФП) КАК ИА_ИсторияСтатусовЗВССрезПоследних
	               |		ПО ЗаказыОстатки.ЗП = ИА_ИсторияСтатусовЗВССрезПоследних.ЗВС
	               |ГДЕ
	               |	ЗаказыОстатки.ЗП.Сумма - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход, 0) > 0";
	ВсеДанные = запрос.Выполнить().Выгрузить();
	
	//////////
	Если Настройки[0].Выбрать Тогда // Сводно по организациям
		ВывестиСводнуюТаблицу(макет, табдок, ВсеДанные, "Организация", "ОРГАНИЗАЦИЯМ", "ОРГАНИЗАЦИЯ")
	КонецЕсли;
	
	
	Если ЧтоТоВыбрано Тогда
		
		для каждого текОрг из ВыбОрг Цикл
			Обл = макет.ПолучитьОбласть("ГруппаОрганизация");
			обл.параметры.Организация = текОрг;
			ТабДок.Вывести(обл);

			ТекДанные = ВсеДанные.Скопировать();
			Сч = ТекДанные.Количество() - 1;
			Пока сч >=0 Цикл
				если ТекДанные[сч].Организация <> текОрг Тогда
					ТекДанные.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			
			//
			Если Настройки[1].Выбрать Тогда // Сводно по счетам
				ТекДанные.Сортировать("СчетНаименование");
				ВывестиСводнуюТаблицу(макет, табдок, ТекДанные, "Счет", "СЧЕТАМ", "СЧЕТ ОРГАНИЗАЦИИ")
			КонецЕсли;	
			
			//
			Если Настройки[2].Выбрать Тогда // Сводно по подразделениям
				ТекДанные.Сортировать("ПодразделениеНаименование");
				ВывестиСводнуюТаблицу(макет, табдок, ТекДанные, "Подразделение", "ПОДРАЗДЕЛЕНИЯМ", "ПОДРАЗДЕЛЕНИЕ")
			КонецЕсли;
			
			//
			Если Настройки[3].Выбрать Тогда // Сводно по фондам				
				ТекДанные.Сортировать("ФондНаименование");
				ВывестиСводнуюТаблицу(макет, табдок, ТекДанные, "Фонд", "ФОНДАМ", "ФОНД");				
			КонецЕсли;
			
			//
			Если Настройки[4].Выбрать Тогда // Сводно по фондам и статьям
				ТекДанные.Сортировать("ФондНаименование,СтатьяНаименование");
				ВывестиСводнуюТаблицу(макет, табдок, ТекДанные, "Фонд", "СТАТЬЯМ РАСХОДА", "ФОНД / СТАТЬЯ РАСХОДА", "Статья")
			КонецЕсли;
			
			//////////////////////////
			
			//
			Если Настройки[5].Выбрать Тогда // Список незакрытых заказов
				ТекДанные.Сортировать("Номер");
				ВывестиВсеЗаказы(макет, табдок, ТекДанные, КонецДня(НаДату));
			КонецЕсли;
			
			//
			Если Настройки[6].Выбрать Тогда // список просроченных заказов
				ТекДанные.Сортировать("Просрочено УБЫВ");				
				ВывестиПросроченныеЗаказы(макет, табдок, ТекДанные, КонецДня(НаДату));
			КонецЕсли;
			
			//////////////////////////
			
			//
			Если Настройки[7].Выбрать Тогда // Детализация по фондам (и подразделениям)
				ТекДанные.Сортировать("ФондНаименование, ПодразделениеНаименование");
				ВывестиДетализацию(макет, табдок, ТекДанные, "Фонд", "ФОНДАМ (группировка по подразделениям)", "Подразделение", "Статья расходов", "Статья", КонецДня(НаДату))
			КонецЕсли;
			
			//
			Если Настройки[8].Выбрать Тогда // Детализация по фондам (и статьям)
				ТекДанные.Сортировать("ФондНаименование, СтатьяНаименование");
				ВывестиДетализацию(макет, табдок, ТекДанные, "Фонд", "ФОНДАМ (группировка по статьям)", "Статья", "Подразделение", "Подразделение", КонецДня(НаДату))
			КонецЕсли;
			
			//
			Если Настройки[9].Выбрать Тогда // Детализация по подразделениям
				ТекДанные.Сортировать("ПодразделениеНаименование, ФондНаименование");
				ВывестиДетализацию(макет, табдок, ТекДанные, "Подразделение", "ПОДРАЗДЕЛЕНИЯМ", "Фонд", "Статья расходов", "Статья", КонецДня(НаДату))
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;	
		
	Обл = макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	Элементы.ТабДок.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиПросроченныеЗаказы(макет, табдок, тз, ДоДаты)

	СтрокиПроср = тз.НайтиСтроки(новый структура("ЭтоПросрочка", истина));
	Если СтрокиПроср.количество() = 0 Тогда
		Обл = макет.ПолучитьОбласть("ПросрШапкаПусто");
		ТабДок.Вывести(обл);
		Возврат;
	КонецЕсли;
	
	Обл = макет.ПолучитьОбласть("ПросрШапка");
	ТабДок.Вывести(обл);
	
	Для каждого стрДет из СтрокиПроср Цикл	
		Обл = макет.ПолучитьОбласть("ПросрСтрока");
		ЗаполнитьЗначенияСвойств(обл.параметры, стрДет); 
		РегистраторыСтрукт = ПолучитьПредставлениеРегистраторов(стрДет.Заказ, ДоДаты);
		ЗаполнитьЗначенияСвойств(обл.параметры, РегистраторыСтрукт);
		ТабДок.Вывести(обл);
	КонецЦикла;
			
	Обл = макет.ПолучитьОбласть("ПросрИтого");
	обл.параметры.СуммаЗаказа = тз.итог("СуммаЗаказа");
	обл.параметры.ОсталосьОдобрить = тз.итог("ОсталосьОдобрить");
	обл.параметры.ОсталосьВыплатить = тз.итог("ОсталосьВыплатить");
	ТабДок.Вывести(обл);
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиВсеЗаказы(макет, табдок, тз, ДоДаты)

	Обл = макет.ПолучитьОбласть("СписокШапка");
	ТабДок.Вывести(обл);
	
	Для каждого стрДет из тз Цикл	
		Обл = макет.ПолучитьОбласть("СписокСтрока");
		ЗаполнитьЗначенияСвойств(обл.параметры, стрДет); 
		РегистраторыСтрукт = ПолучитьПредставлениеРегистраторов(стрДет.Заказ, ДоДаты);
		ЗаполнитьЗначенияСвойств(обл.параметры, РегистраторыСтрукт);
		ТабДок.Вывести(обл);
	КонецЦикла;
			
	Обл = макет.ПолучитьОбласть("СписокИтого");
	обл.параметры.СуммаЗаказа = тз.итог("СуммаЗаказа");
	обл.параметры.Одобрено = тз.итог("Одобрено");
	обл.параметры.Выплачено = тз.итог("Выплачено");
	обл.параметры.ОсталосьВыплатитьОдобр = тз.итог("ОсталосьВыплатитьОдобр");
	обл.параметры.ОсталосьОдобрить = тз.итог("ОсталосьОдобрить");
	обл.параметры.ОсталосьВыплатить = тз.итог("ОсталосьВыплатить");
	ТабДок.Вывести(обл);
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДетализацию(макет, табдок, тз, группировка, заголовок, ДопГруппировка = "", заголовокКол, имяКол, ДоДаты)

	Обл = макет.ПолучитьОбласть("ДетализацияШапка");
	обл.параметры.заголовок = заголовок;
	ТабДок.Вывести(обл);
	
	тзДетал = тз.Скопировать();
	тзДетал.Свернуть(группировка, "СуммаЗаказа, Одобрено, Выплачено, ОсталосьВыплатитьОдобр, ОсталосьОдобрить, ОсталосьВыплатить");
	
	Для каждого стрДет из тзДетал Цикл	
		Обл = макет.ПолучитьОбласть("ДетализацияШапкаГруппировка");		
		обл.параметры.Группировка = стрДет[группировка]; 
		обл.параметры.заголовокКол = заголовокКол;
		ТабДок.Вывести(обл);
		
	
		тзДетал1 = тз.Скопировать();
		Сч = тзДетал1.Количество() - 1;
		Пока сч >=0 Цикл
			если тзДетал1[сч][группировка] <> стрДет[группировка] Тогда
				тзДетал1.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
		тзДетал1.Свернуть(ДопГруппировка, "СуммаЗаказа, Одобрено, Выплачено, ОсталосьВыплатитьОдобр, ОсталосьОдобрить, ОсталосьВыплатить");
		Для каждого стрДет1 из тзДетал1 Цикл	
			Обл = макет.ПолучитьОбласть("ДетализацияСтрокаГруппировка");
			обл.параметры.Группировка = стрДет1[ДопГруппировка]; 
			ТабДок.Вывести(обл);
			
			СтрокиПоЗаказам = тз.НайтиСтроки(Новый структура(группировка +"," + ДопГруппировка, стрДет[группировка], стрДет1[ДопГруппировка]));
			Для каждого стрЗаказ из СтрокиПоЗаказам цикл
				Обл = макет.ПолучитьОбласть("ДетализацияСтрока");
				ЗаполнитьЗначенияСвойств(обл.параметры, стрЗаказ); 
				обл.параметры.СтатьяПодразделение = стрЗаказ[имяКол];
				РегистраторыСтрукт = ПолучитьПредставлениеРегистраторов(стрЗаказ.Заказ, ДоДаты);
				ЗаполнитьЗначенияСвойств(обл.параметры, РегистраторыСтрукт);
				ТабДок.Вывести(обл);
			КонецЦикла;
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("ДетализацияИтого");
		обл.параметры.СуммаЗаказа = тзДетал1.итог("СуммаЗаказа");
		обл.параметры.Одобрено = тзДетал1.итог("Одобрено");
		обл.параметры.Выплачено = тзДетал1.итог("Выплачено");
		обл.параметры.ОсталосьВыплатитьОдобр = тзДетал1.итог("ОсталосьВыплатитьОдобр");
		обл.параметры.ОсталосьОдобрить = тзДетал1.итог("ОсталосьОдобрить");
		обл.параметры.ОсталосьВыплатить = тзДетал1.итог("ОсталосьВыплатить");
		ТабДок.Вывести(обл);

	КонецЦикла;
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРегистраторов(заказ, доДаты)
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваВРезервеНаФондахОбороты.Регистратор КАК Регистратор,
	               |	ИА_СредстваВРезервеНаФондахОбороты.Регистратор.Номер КАК Номер,
	               |	ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход КАК СуммаБезналПриход,
	               |	ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход КАК СуммаБезналРасход
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &ДоДаты, Регистратор, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_СредстваВРезервеНаФондахОбороты.Период";
	Запрос.УстановитьПараметр("ЗП", заказ);
	Запрос.УстановитьПараметр("доДаты", доДаты);
	Выборка = запрос.Выполнить().Выбрать();
	
	рез = "";
	масс = новый массив;
	Пока выборка.Следующий() цикл
		Если рез <> "" Тогда
			рез = рез + ", ";
		КонецЕсли;
		ном = УбратьНули(выборка.Номер);
		
		Предст = "";
		Если ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.ИА_ФинансовоеПланирование") Тогда
			Предст = "ФП №"+ном;
		ИначеЕсли ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.КСУ_ВнедоходноеПоступлениеСредств") Тогда
			Предст = "ВДПС №"+ном;
		ИначеЕсли ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.КСУ_ФормальнаяВыплата") Тогда
			Предст = "Форм. выплата №"+ном;
		ИначеЕсли ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.ИА_ЗакрытиеЗаказаНаПриобретение") Тогда
			Предст = "Закрытие №"+ном;
		ИначеЕсли Выборка.СуммаБезналПриход > 0 Тогда
			Предст = "Возврат №"+ном;
		Иначе
			Предст = "Выплата №"+ном;
		КонецЕсли;
		
		рез = рез + Предст;
		масс.Добавить(Выборка.Регистратор);
	КонецЦикла;
	
	РезСтрукт = Новый Структура("Регистраторы, РегистраторыМассив", рез, масс); 
	
	возврат РезСтрукт;
КонецФункции

&НаСервереБезКонтекста
Функция УбратьНули(номер)
	рез = номер; 
	Пока Лев(рез, 1) = "0" Цикл 
	    рез = Прав(рез, СтрДлина(рез) - 1);
	КонецЦикла;
	Возврат рез;
КонецФункции

&НаСервереБезКонтекста
Процедура ВывестиСводнуюТаблицу(макет, табдок, тз, группировка, заголовок, заголовокКолонки, ДопГруппировка = "")

	Обл = макет.ПолучитьОбласть("СводноШапка");
	обл.параметры.заголовок = заголовок;
	обл.параметры.заголовокКолонки = заголовокКолонки;
	ТабДок.Вывести(обл);
	
	тзДетал = тз.Скопировать();
	тзДетал.Свернуть(группировка, "СуммаЗаказа, Одобрено, Выплачено, ОсталосьВыплатитьОдобр, ОсталосьОдобрить, ОсталосьВыплатить");
	
	Для каждого стрДет из тзДетал Цикл	
		Если ДопГруппировка = "" Тогда
			Обл = макет.ПолучитьОбласть("СводноСтрока");		
		Иначе
			Обл = макет.ПолучитьОбласть("СводноСтрокаГруппировка");		
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(обл.параметры, стрДет);
		обл.параметры.Группировка = стрДет[группировка]; 
		ТабДок.Вывести(обл);
		
		Если ДопГруппировка <> "" Тогда
			тзДетал1 = тз.Скопировать();
			Сч = тзДетал1.Количество() - 1;
			Пока сч >=0 Цикл
				если тзДетал1[сч][группировка] <> стрДет[группировка] Тогда
					тзДетал1.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			тзДетал1.Свернуть(ДопГруппировка, "СуммаЗаказа, Одобрено, Выплачено, ОсталосьВыплатитьОдобр, ОсталосьОдобрить, ОсталосьВыплатить");
			Для каждого стрДет1 из тзДетал1 Цикл	
				Обл = макет.ПолучитьОбласть("СводноСтрока");
				ЗаполнитьЗначенияСвойств(обл.параметры, стрДет1);
				обл.параметры.Группировка = стрДет1[ДопГруппировка]; 
				ТабДок.Вывести(обл);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Обл = макет.ПолучитьОбласть("СводноИтого");
	обл.параметры.СуммаЗаказа = тзДетал.итог("СуммаЗаказа");
	обл.параметры.Одобрено = тзДетал.итог("Одобрено");
	обл.параметры.Выплачено = тзДетал.итог("Выплачено");
	обл.параметры.ОсталосьВыплатитьОдобр = тзДетал.итог("ОсталосьВыплатитьОдобр");
	обл.параметры.ОсталосьОдобрить = тзДетал.итог("ОсталосьОдобрить");
	обл.параметры.ОсталосьВыплатить = тзДетал.итог("ОсталосьВыплатить");
	ТабДок.Вывести(обл);
	
КонецПроцедуры

	
&НаКлиенте
Процедура Сформировать(Команда)	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	НаДату = ТекущаяДата();
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по организациям (головным)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по счетам";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по подразделениям";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по фондам";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по фондам и статьям";
	НовстрН.Выбрать = ложь;

	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Список заказов";
	НовстрН.Выбрать = Истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Список просроченных заказов";
	НовстрН.Выбрать = ложь;

	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Детализация по фондам (и подразделениям)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Детализация по фондам (и статьям)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Детализация по подразделениям";
	НовстрН.Выбрать = ложь;
	
	//
	МассОрг = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Для каждого орг из МассОрг Цикл
		НовстрН = Организации.Добавить();
		НовстрН.Организация = орг;
		НовстрН.Выбрать = истина;
	КонецЦикла;
	
	Выборка = Справочники.Организации.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = ОрганизацииДочерние.Добавить();
			НовстрН.Организация = выборка.Ссылка;
			НовстрН.Выбрать = истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаОрганизацииДочерние.Видимость = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	
	Если не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить() Тогда
		НовстрН = Организации.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
		
		НовстрН = ОрганизацииДочерние.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
	КонецЕсли;
	//
	
	//
	Выборка= Справочники.ИА_ЦФО.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = Подразделения.Добавить();
			НовстрН.Подразделение = выборка.Ссылка;
			НовстрН.Выбрать = истина;		
		КонецЕсли;
	КонецЦикла;
	НовстрН = Подразделения.Добавить();
	НовстрН.Подразделение = Справочники.ИА_ЦФО.ПустаяСсылка();
	НовстрН.Выбрать = истина;		
	
	//
	ЭтоРСФ = ИА_ФП.ЭтоРСФ();
	Выборка= Справочники.ИА_Фонды.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			Если ЭтоРСФ или выборка.Защищенный = ложь Тогда
				НовстрН = Фонды.Добавить();
				НовстрН.Фонд = Выборка.Ссылка;
				НовстрН.Выбрать = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьФильтры(Команда)
	Элементы.ГруппаПравая.Видимость = не Элементы.ГруппаПравая.Видимость;
	Элементы.ПоказатьСкрытьФильтры.Заголовок = ?(Элементы.ГруппаПравая.Видимость, "Скрыть фильтры", "Показать фильтры")
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Настройки1ВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ФондыВыбратьПриИзменении(Элемент)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПодразделенияВыбратьПриИзменении(Элемент)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Подразделения Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеНастройки(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехНастроек(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Настройки Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОрганизации(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехОрганизаций(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Организации Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеФонды(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехФондов(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Фонды Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеПодразделения(Команда)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Подразделения Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыбоСоВсехПодразделений(Команда)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Подразделения Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура СброситьФильтры(Команда)
	ВыбратьВсеНастройки(Неопределено);
	ВыбратьВсеОрганизации(Неопределено);
	ВыбратьВсеФонды(Неопределено);
	ВыбратьВсеПодразделения(Неопределено);
	
	Элементы.СброситьФильтры.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Скрыть();
	Элементы.ГруппаОрганизацииДочерние.Скрыть();
	Элементы.ГруппаФонды.Скрыть();
	Элементы.ГруппаНастройки.Скрыть();
	Элементы.ГруппаПодразделения.Скрыть();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Показать();
	Элементы.ГруппаОрганизацииДочерние.Показать();
	Элементы.ГруппаФонды.Показать();
	Элементы.ГруппаНастройки.Показать();
	Элементы.ГруппаПодразделения.Показать();
КонецПроцедуры


&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	если ТипЗнч(Расшифровка) = тип("Массив") Тогда
		СтандартнаяОбработка = ложь;
		
		сп = Новый СписокЗначений;
		сп.ЗагрузитьЗначения(Расшифровка);
		
		ОпОп = новый ОписаниеОповещения("ВыборРег", ЭтотОбъект);
		ПоказатьВыборИзСписка(ОпОп, сп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборРег(ВыбЗн, дп) Экспорт
	если ВыбЗн<>Неопределено Тогда
		ПоказатьЗначение(, ВыбЗн.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура pdf(Команда)
	Оповещение  = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогВыбора.ПолноеИмяФайла = "Незакрытые заказы на "+ формат(НаДату, "ДФ=dd.MM.yyyy");
	ДиалогВыбора.Расширение = "pdf";
    ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТабДок.Записать(МассивФайлов[0], ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НаДату = ТекущаяДата();
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацииДочерниеВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизацииДочерние.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ОрганизацииДочерние Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизацииДочерние.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехОрганизацийДочерних(Команда)
	Элементы.ГруппаОрганизацииДочерние.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из ОрганизацииДочерние Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОрганизацииДочерние(Команда)
	Элементы.ГруппаОрганизацииДочерние.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ОрганизацииДочерние Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры
